package com.rw.article.common.constant;

public interface AdminReturnMessage {
    /**
     * 操作成功
     **/
    String MSG_0 = "操作成功！";
    /**
     * 更新成功
     **/
    String MSG_1 = "更新成功";
    /**
     * 更新失败
     **/
    String MSG_2 = "更新失败";
    /**
     * 格式不正确
     **/
    String MSG_3 = "格式不正确";
    /**
     * 创建头像保存目录：
     **/
    String MSG_4 = "创建头像保存目录：";
    /**
     * 上传头像失败，删除图片文件：
     **/
    String MSG_5 = "  上传头像失败，删除图片文件：";
    /**
     * 参数错误
     **/
    String MSG_6 = "参数错误";
    /**
     * 验证码发送失败!
     **/
    String MSG_7 = "验证码发送失败!";
    /**
     * 账户与手机号不匹配!
     **/
    String MSG_8 = "  账户与手机号不匹配!";
    /**
     * 信息不正确!
     **/
    String MSG_9 = "信息不正确!";
    /**
     * 验证码匹配错误,请重新获取!
     **/
    String MSG_10 = "验证码匹配错误,请重新获取!";
    /**
     * 验证码已失效!
     **/
    String MSG_11 = "验证码已失效!";
    /**
     * 用户名已存在！
     **/
    String MSG_12 = "用户名已存在！";
    /**
     * 账户不存在！
     **/
    String MSG_13 = "账户不存在！";
    /**
     * 密码错误！
     **/
    String MSG_14 = "密码错误！";
    /**
     * 您的账户已被锁定,请与管理员联系！
     **/
    String MSG_15 = "您的账户已被锁定,请与管理员联系！";
    /**
     * 登录失败次数过多,请稍后再试！
     **/
    String MSG_16 = "登录失败次数过多,请稍后再试！";
    /**
     * 系统发生错误，请联系管理员！
     **/
    String MSG_17 = "系统发生错误，请联系管理员！";
    /**
     * 银行卡号不正确
     **/
    String MSG_18 = "银行卡号不正确";
    /**
     * 代理商已存在，不能添加
     **/
    String MSG_19 = "代理商已存在，不能添加";
    /**
     * 信息不存在，无法操作
     **/
    String MSG_20 = "信息不存在，无法操作";
    /**
     * 手机号已存在，无法操作
     **/
    String MSG_21 = "手机号已存在，无法操作";
    /**
     * 删除成功！
     **/
    String MSG_22 = "删除成功！";
    /**
     * 帐号或密码错误!
     **/
    String MSG_23 = "帐号或密码错误!";
    /**
     * CODE值已存在！
     **/
    String MSG_24 = "CODE值已存在！";
    /**
     * 不存在，不能操作
     **/
    String MSG_25 = "不存在，不能操作";
    /**
     * 已存在，不能新增
     **/
    String MSG_26 = "已存在，不能新增";
    /**
     * ：道具不存在，不能操作
     **/
    String MSG_27 = " ：道具不存在，不能操作";
    /**
     * ：道具已存在，不能新增
     **/
    String MSG_28 = " ：道具已存在，不能新增";
    /**
     * 数据异常，操作失败
     **/
    String MSG_29 = " 数据异常，操作失败";
    /**
     * 用户名与密码不匹配！
     **/
    String MSG_30 = " 用户名与密码不匹配！";
    /**
     * 用户状态异常,不能登录
     **/
    String MSG_31 = " 用户状态异常,不能登录";
    /**
     * 状态异常,不能登录
     **/
    String MSG_32 = " 状态异常,不能登录";
    /**
     * 登录成功！
     **/
    String MSG_33 = "  登录成功！";
    /**
     * 登录失败！
     **/
    String MSG_34 = " 登录失败！";
    /**
     * 获取微信信息失败！
     **/
    String MSG_35 = "  获取微信信息失败！";
    /**
     * 上传成功,请等待审核!
     **/
    String MSG_36 = "  上传成功,请等待审核!";
    /**
     * 上传错误
     **/
    String MSG_37 = " 上传错误";
    /**
     * 包标识重复
     **/
    String MSG_38 = "   包标识重复";
    /**
     * 添加成功
     **/
    String MSG_39 = " 添加成功";
    /**
     * 重置完成
     **/
    String MSG_40 = "   重置完成";
    /**
     * 成功
     **/
    String MSG_41 = " 成功";
    /**
     * 失败
     **/
    String MSG_42 = " 失败";
    /**
     * 数据格式错误
     **/
    String MSG_43 = "  数据格式错误";
    /**
     * 补偿
     **/
    String MSG_44 = "  补偿";
    /**
     * 充值
     **/
    String MSG_45 = "  充值";
    /**
     * 系统消息
     **/
    String MSG_46 = "  系统消息";
    /**
     * 系统
     **/
    String MSG_47 = "  系统";
    /**
     * 给您
     **/
    String MSG_48 = "  给您";
    /**
     * 金币，已存入您的保险箱。
     **/
    String MSG_49 = "  金币，已存入您的保险箱。";
    /**
     * 扣除金额不能大于账户余额
     **/
    String MSG_50 = "  扣除金额不能大于账户余额";
    /**
     * 操作失败
     **/
    String MSG_51 = "  操作失败";
    /**
     * 您于
     **/
    String MSG_52 = "  您于";
    /**
     * 您上传的头像审核已通过！
     **/
    String MSG_53 = " 您上传的头像审核已通过！";
    /**
     * 写入文件出错：
     **/
    String MSG_54 = " 写入文件出错：";
    /**
     * 操作失败，id为空
     **/
    String MSG_55 = " 操作失败，id为空";
    /**
     * 非法操作
     **/
    String MSG_56 = " 非法操作";
    /**
     * 您上传的头像审核未通过
     **/
    String MSG_57 = "  您上传的头像审核未通过";
    /**
     * 申请的
     **/
    String MSG_58 = " 申请的";
    /**
     * 金额提现已到账，请查收！
     **/
    String MSG_59 = "  金额提现已到账，请查收！";
    /**
     * 金额提现已退款，金币已存入您的保险箱！
     **/
    String MSG_60 = " 金额提现已退款，金币已存入您的保险箱！";
    /**
     * 支付失败：
     **/
    String MSG_61 = "  支付失败：";
    /**
     * 金额提现已被拒付款；操作理由：
     **/
    String MSG_62 = "  金额提现已被拒付款；操作理由：";
    /**
     * 金额提现已退款，金币已存入您的保险箱！操作理由：
     **/
    String MSG_63 = "金额提现已退款，金币已存入您的保险箱！操作理由：";
    /**
     * 操作失败，修改无效
     **/
    String MSG_64 = " 操作失败，修改无效";
    /**
     * 已有这个登录名,请重新设置
     **/
    String MSG_65 = " 已有这个登录名,请重新设置";
    /**
     * 操作失败,code不能为空
     **/
    String MSG_66 = "  操作失败,code不能为空";
    /**
     * 创建订单失败
     **/
    String MSG_67 = " 创建订单失败";
    /**
     * 参数错误
     **/
    String MSG_68 = "  参数错误";
    /**
     * 创建提现失败
     **/
    String MSG_69 = "  创建提现失败";
    /**
     * 创建提现单失败
     **/
    String MSG_70 = " 创建提现单失败";
    /**
     * 保存异常
     **/
    String MSG_71 = " 保存异常";
    /**
     * 打款失败
     **/
    String MSG_72 = " 打款失败";
    /**
     * 执行打款失败
     **/
    String MSG_73 = " 执行打款失败";
    /**
     * 修改提现失败
     **/
    String MSG_74 = " 修改提现失败";
    /**
     * 账户账号已存在
     **/
    String MSG_75 = " 账户账号已存在";
    /**
     * 该手机号已存在
     **/
    String MSG_76 = " 该手机号已存在";
    /**
     * 两次密码不一致
     **/
    String MSG_77 = " 两次密码不一致";
    /**
     * 商务ID不存在!
     **/
    String MSG_78 = " 商务ID不存在!";
    /**
     * 手机号不正确
     **/
    String MSG_79 = " 手机号不正确";
    /**
     * 重置失败
     **/
    String MSG_80 = " 重置失败";
    /**
     * 银行卡账号错误
     **/
    String MSG_81 = " 银行卡账号错误";
    /**
     * 至少输入一种收款方式
     **/
    String MSG_82 = "至少输入一种收款方式";
    /**
     * 在线客服
     **/
    String MSG_83 = "  在线客服";
    /**
     * 您没有权限
     **/
    String MSG_84 = "  权限不足";
    /**
     * "您于%s充值%s金额已存入您的保险箱，请注意查收"
     **/
    String MSG_85 = "您于%s充值%s金额已存入您的保险箱，请注意查收";

    /**
     * "您于%s充值%s金额已存入您的背包，请注意查收"
     **/
    String MSG_86 = "您于%s充值%s金额已存入您的背包，请注意查收";

    /**用户协议***/

    String USERAGREEMENTT = "东方会-用户服务协议"
            +"东方会-在此特别提醒用户认真阅读《东方会-用户服务协议》,本协议是用户与东方会-及其运营合作单位之间关于用户下载、安装、使用、复制''东方会-''软件,注册、使用、管理东方会-账号所订立的协议。除非您接受本《协议》条款，否则您无权下载、安装或使用本软件及其相关服务。您的安装使用行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。"
            +"#1.东方会-的服务 "
            +"#     1.1　东方会-的服务由东方会-根据实际情况提供，包括但不限于线上游戏及其他增值服务等。"
            +"#     1.2　东方会-拥有向用户提供服务过程中所产生并存储于东方会-游戏系统中的任何数据（包括但不限于账号、游戏银子、积分、级别等游戏数据）的所有权。"
            +"#     1.3　用户充值东方会-银子、金子、比赛币至固定账号后，未经东方会-明示同意不得将其再转至其他账号。 "
            +"#     1.4　东方会-仅提供相关的网络服务,除此之外与相关网络服务有关的上网设备(如电脑、调制解调器及其他互联网接入装置)及所需的费用（如为接入互联网而支付的电话费、上网费）均由用户自行负担。"
            +"#2.用户使用需知 "
            +"#     2.1　用户承诺按照东方会-的要求提供准确、真实、完整的个人注册信息。 "
            +"#     2.2　用户可以选择东方会-的保护服务以保障账号安全。用户选择保护服务时应按照要求填写身份证、护照等证件的号码，作为东方会-判断账号使用权归属的最终依据。 "
            +"#     2.3　个人资料发生变更，如用户延迟更新个人注册信息导致影响东方会-对该用户提供服务，则由此产生的全部责任均由用户承担。 "
            +"#     2.4  东方会-账号使用权仅属初始申请注册人，禁止转让、售卖。如果东方会-账号现使用者并非账号初始注册人，东方会-有权回收该帐号。东方会-禁止用户私下有偿或无偿转让账号，以免因账号问题产生纠纷，用户因违反此要求遭致的任何损失由用户自行承担。"
            +"#     2.5  使用''东方会-软件''必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本协议，对于用户违法或违反本协议的使用而引起的一切责任，由用户负全部责任，一概与东方会-及合作单位无关。导致东方会-及合作单位损失的，东方会-及合作单位有权要求用户赔偿，并有权立即停止向其提供服务，保留相关记录，保留配合司法机关追究法律责任的权利。"
            +"#     2.6  东方会-将会采取合理的措施保护用户的信息资源，除法律或政府要求或用户同意等原因外，东方会-未经用户同意不向除合作单位以外的第三方公开、透露用户信息资源。但是用户在注册时选择或同意，或用户与东方会-及合作单位之间就用户信息资源公开或使用另有约定的除外，同时用户应自行承担因此可能产生的任何风险，东方会-对此不予负责。"
            +"#     2.7  东方会-有权调整其服务的收费标准，并保留对提供给用户的免费服务项目收取相应费用的权利，如用户拒绝按收费标准交费，则东方会-不再提供相应的服务。"
            +"#3.用户会员资格的规定 "
            +"#     3.1　用户可以通过实物卡注册、游戏充值兑换等东方会-规定的方式取得会员资格，享受东方会-按照其规定提供的会员服务。 "
            +"#     3.2　用户在注册或兑换会员资格时，用户应谨慎核对其注册或兑换会员资格的账号。如非东方会-原因导致其账号未获得会员资格，东方会-对由此可能导致的用户利益损失不承担任何责任。 "
            +"#     3.3　为保障用户正常行使其基于会员资格享有的权利，用户需申请密码保护，并提供真实准确的个人身份证件号码。 "
            +"#     3.4　已注册或兑换的会员资格仅限于用户固定账号使用，用户不得将其转到其他账号上。"
            +"#4.用户账号密码的安全性 "
            +"#     4.1　用户应维持账号密码的安全，妥善保管，谨防被盗或泄露，不应将账号出借或者转让他人使用，并对任何人利用其账号所进行的活动负完全的责任。本服务条款所指密码，包含平台的帐号登录密码、银行密码及其他二级密码。 "
            +"#     4.2　因非东方会-原因导致账号密码丢失或被盗以及造成其他损失，均由用户自行承担损失。用户发现其账号被他人非法使用，应立即通知东方会-，并根据东方会-的要求提交其拥有该账号使用权的证明及其他材料。东方会-有权封存该账号以保障用户的权利。 "
            +"#     4.3　用户可以更改账号的密码，也可以申请新账号，但不可以要求删除旧账号。 "
            +"#     4.4　用户向东方会-查询、修改或重置其账号密码时，必须提供完全准确的个人注册信息（包括注册时间），否则东方会-有权本着为用户保密的原则不予受理服务。 "
            +"#     4.5  如用户注册后三个月内或者连续六个月没有进行账号登录，东方会-有权收回和处分该账号的使用权；对于该账号上附随的游戏数据、虚拟财产以及其他东方会-产品和服务等，东方会-不承担返还、退费、赔偿或补偿等任何形式的责任。上述游戏数据、虚拟财产以及其他产品和服务包括但不限于游戏银子、金子、比赛币等。"
            +"#5.法律责任与免责 "
            +"#     5.1  用户违反本协议或相关服务条款的规定，导致或产生的任何第三方主张的索赔、要求或损失，包括合理的律师费，由用户赔偿东方会-与合作公司、关联公司，并使之免受损害。对此，东方会-有权视用户的行为性质，采取包括但不限于中断使用许可、停止提供服务、限制使用、回收用户东方会-账号、法律追究等措施。对利用东方会-账号进行违法活动、捣乱、骚扰、欺骗其他用户等行为，东方会-有权回收其账号。同时，东方会-有权配合司法部门协助调查。"
            +"#     5.2  使用''东方会-客户端软件''由用户自行承担风险，东方会-及合作单位对本\"软件\"不作任何类型的担保，不论是明示的、默示的或法令的保证和条件，对在任何情况下因使用或不能使用本''软件''所产生的直接、间接、偶然、特殊及后续的损害及风险，东方会-及合作单位不承担任何责任。"
            +"#     5.3  使用''东方会-客户端软件''涉及到互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户须充分认识并自行承担以上风险，用户因此不能正常使用服务的，东方会-及合作单位不承担任何责任。"
            +"#6.服务条款的修改或补充 "
            +"东方会-保留随时修改或补充本服务条款的权利，修改或补充本服务条款时，东方会-将以公告的方式通知用户，而不另对用户进行个别通知。若用户不同意修改或补充的内容，可停止使用东方会-的服务，东方会-不承担返还、退费、赔偿或者补偿等任何形式的责任。若用户继续使用东方会-的服务，即视为用户已接受东方会-所修改或补充的内容。"
            +"#7.服务的变更、中断或终止 "
            +"用户原因导致服务中断、终止，东方会-不承担退费、补偿等责任；东方会-有权以事前或事后通知的方式变更、中断或终止部分或全部服务，因此造成用户或第三方损失的，东方会-不承担退费、赔偿或者补偿等任何形式的责任。"
            +"#8.损害赔偿 "
            +"用户若违反本服务条款或东方会-相关规定，导致东方会-、合作单位或其他用户因此而受到损害（包括但不限于由法律诉讼、行政程序等所支出的诉讼费用、律师费用、实际遭受损失的费用等），用户应负担损害赔偿责任。"
            +"#9.用户纠纷处理机制 "
            +"#     9.1　用户就账号等游戏数据的使用权归属等存在争议，可以通过东方会-网站提供的客服渠道进行处理。 "
            +"#     9.2　用户须按照东方会-处理各类事务的要求、流程，对自己的主张提供相应的材料予以证明。如用户不能提供充分材料证明其主张成立，因此受到损失的，则由用户独立承担全部责任。 "
            +"#     9.3　用户证明其会员资格时，应根据东方会-的要求提供身份证件以及其他资料。如因用户无法证明其会员资格影响东方会-为其提供服务，则由该用户承担全部责任。 "
            +"#     9.4　用户同意以东方会-系统所记载的数据作为处理用户之间或用户与东方会-之间纠纷的判断标准。 "
            +"#     9.5　用户自行承担其因处理此类纠纷而产生之通讯费、邮寄费、交通费等一切费用。"
            +"#10.法律管辖 "
            +"本服务条款以及东方会-相关规定的订立、执行和解释及争议的解决均适用中华人民共和国法律、行政法规有关规定。如发生服务条款与法律条款有相抵触的内容，以法律条款为准。 "
            +"#11.通知和送达 "
            +"#     11.1 东方会-通过网站、论坛、通告栏、系统信息等发布公告为主要通知方式，自公告发布之日起即为送达。因用户原因没有及时看到通知而产生的损害，东方会-对此不承担任何责任。 "
            +"#     11.2 在个别情况下会通过登录提示、电子邮件、常规信件或电话等方式通知，但东方会-没有以此方式进行个别通知的义务。 "
            +"#     12.其他规定 "
            +"#     12.1 东方会-相关规定与用户服务条款具有同等效力，共同构成对本服务之约定事项及其他有关事宜的完整协议，用户应一并遵守。 "
            +"#     12.2 如本服务条款中的任何条款完全或部分无效，本服务条款的其余条款仍有效且具有约束力。 "
            +"#     12.3 本服务条款的最终解释权归东方会-所有。";
}
